{
    "intents": [
         {
            "tag": "تعريف المرض",
            "patterns": [
                "اشرح لي [X]",
                "حكيلي عن [X]",
                "شو بتعرف عن [X]",
                "شو يعني [X]",
                "عرف [X]",
                "ماذا يعني [X]",
                "ما هو [X]",
                "مامعنى [X]"
            ],
            "slots": {
                "X": [
                    "ALT",
                    "alt",
                    "CRP",
                    "crb",
                    "DBP",
                    "dbp",
                    "FASTINGBS",
                    "fastingbs",
                    "HDL",
                    "hdl",
                    "HBA1C",
                    "hba1c",
                    "LDL",
                    "ldl",
                    "MCH",
                    "mch",
                    "MCHC",
                    "mchc",
                    "MCV",
                    "mcv",
                    "MAXHR",
                    "maxhr",
                    "RESTINGECG",
                    "restingecg",
                    "SBP",
                    "sbp",
                    "WBC",
                    "wbc",
                    "اختبار الجلوكوز الصيامي",
                    "اختبار وظائف الرئة",
                    "ارتفاع ضغط الدم",
                    "اقصى معدل ضربات القلب",
                    "الاكتئاب",
                    "الانسولين",
                    "الانيميا(فقر الدم)",
                    "الباركنسون",
                    "التهاب الكبد",
                    "الجلطة",
                    "الربو",
                    "الزهايمر",
                    "السكري",
                    "القلب",
                    "الكرياتينين",
                    "الكوليسترول الجيد",
                    "الكوليسترول الضار",
                    "الهيماتوكريت",
                    "الهيموغلوبين السكري",
                    "بروتين سي التفاعلي",
                    "تركيز الهيموجلوبين في الكريات",
                    "خلايا الدم البيضاء",
                    "سكر الدم الصائم",
                    "سكري الحمل",
                    "ضغط الدم الانبساطي",
                    "ضغط الدم الانقباضي",
                    "فرط نشاط الغدة الدرقية",
                    "قصور الغدة الدرقية",
                    "قياس النشاط الكهربائي للقلب",
                    "متوسط الهيموجلوبين في الكريات",
                    "متوسط حجم الكريات",
                    "سرطان الرئة",
                    "سرطان الثدي"

                ]
            },
            "responses": {
                "ALT": "انزيم ALT : هو إنزيم يوجد بشكل أساسي في الكبد ويمكن أن يرتفع عند حدوث ضرر في الكبد.",
                "alt": "انزيم ALT : هو إنزيم يوجد بشكل أساسي في الكبد ويمكن أن يرتفع عند حدوث ضرر في الكبد.",
                "CRP": "بروتين سي التفاعلي (CRP) : هو مؤشر للالتهاب في الجسم.",
                "crb": "بروتين سي التفاعلي (CRP) : هو مؤشر للالتهاب في الجسم.",
                "DBP": "ضغط الدم الانبساطي (DBP) : هو الضغط في الشرايين عندما يكون القلب في حالة راحة بين النبضات.",
                "dbp": "ضغط الدم الانبساطي (DBP) : هو الضغط في الشرايين عندما يكون القلب في حالة راحة بين النبضات.",
                "FASTINGBS": "FastingBS (سكر الدم الصائم) هو قياس لمستوى سكر الجلوكوز في الدم بعد فترة صيام تتراوح عادةً بين 8 ساعات، ويستخدم لتشخيص داء السكري ومراقبة التحكم في سكر الدم.",
                "fastingbs": "FastingBS (سكر الدم الصائم) هو قياس لمستوى سكر الجلوكوز في الدم بعد فترة صيام تتراوح عادةً بين 8 ساعات، ويستخدم لتشخيص داء السكري ومراقبة التحكم في سكر الدم.",
                "HDL": "الكوليسترول الجيد(HDL): هو نوع من الكوليسترول الذي يساعد في إزالة الكوليسترول الضار من الشرايين.",
                "hdl": "الكوليسترول الجيد(HDL): هو نوع من الكوليسترول الذي يساعد في إزالة الكوليسترول الضار من الشرايين.",
                "HBA1C": "الهيموجلوبين السكري (HbA1c) : هو مقياس لمتوسط مستويات السكر في الدم على مدار الشهرين إلى الثلاثة الماضية.",
                "hba1c": "الهيموجلوبين السكري (HbA1c) : هو مقياس لمتوسط مستويات السكر في الدم على مدار الشهرين إلى الثلاثة الماضية.",
                "LDL": "الكوليسترول الضار (LDL) :هو نوع من الكوليسترول الذي يمكن أن يتراكم في الشرايين ويزيد من خطر الإصابة بأمراض القلب.",
                "ldl": "الكوليسترول الضار (LDL) :هو نوع من الكوليسترول الذي يمكن أن يتراكم في الشرايين ويزيد من خطر الإصابة بأمراض القلب.",
                "MCH": "متوسط الهيموجلوبين في الكريات (MCH) : هو متوسط كمية الهيموجلوبين في خلايا الدم الحمراء.",
                "mch": "متوسط الهيموجلوبين في الكريات (MCH) : هو متوسط كمية الهيموجلوبين في خلايا الدم الحمراء.",
                "MCHC": " تركيز الهيموجلوبين في الكريات (MCHC) :هو متوسط تركيز الهيموجلوبين في خلايا الدم الحمراء.",
                "mchc": " تركيز الهيموجلوبين في الكريات (MCHC) :هو متوسط تركيز الهيموجلوبين في خلايا الدم الحمراء.",
                "MCV": "متوسط حجم الكريات (MCV) :هو الحجم المتوسط لخلايا الدم الحمراء.",
                "mcv": "متوسط حجم الكريات (MCV) :هو الحجم المتوسط لخلايا الدم الحمراء.",
                "MAXHR": "  هو أعلى عدد لنبضات القلب يمكن أن يصل إليه الشخص أثناء ممارسة النشاط البدني أو التمارين الرياضية. يُستخدم لتقييم مستوى اللياقة البدنية وقياس الجهد البدني MaxHR،",
                "maxhr": "  هو أعلى عدد لنبضات القلب يمكن أن يصل إليه الشخص أثناء ممارسة النشاط البدني أو التمارين الرياضية. يُستخدم لتقييم مستوى اللياقة البدنية وقياس الجهد البدني MaxHR،",
                "RESTINGECG": "RestingECG (تخطيط القلب الكهربائي أثناء الراحة) هو اختبار يقيس النشاط الكهربائي للقلب في حالة الراحة، ويهدف إلى تقييم وظيفة القلب، وتشخيص حالات معينة مثل احتشاء عضلة القلب، وتوجيه العلاجات بناءً على النتائج.",
                "restingecg": "RestingECG (تخطيط القلب الكهربائي أثناء الراحة) هو اختبار يقيس النشاط الكهربائي للقلب في حالة الراحة، ويهدف إلى تقييم وظيفة القلب، وتشخيص حالات معينة مثل احتشاء عضلة القلب، وتوجيه العلاجات بناءً على النتائج.",
                "SBP": "ضغط الدم الانقباضي (SBP) :هو الضغط في الشرايين عند نبض القلب.",
                "sbp": "ضغط الدم الانقباضي (SBP) :هو الضغط في الشرايين عند نبض القلب.",
                "WBC": "خلايا الدم البيضاء (WBC) : هي خلايا الجهاز المناعي التي تساعد في مكافحة العدوى.",
                "wbc": "خلايا الدم البيضاء (WBC) : هي خلايا الجهاز المناعي التي تساعد في مكافحة العدوى.",
                "اختبار الجلوكوز الصيامي": "هو اختبار يقيس مستوى السكر في الدم بعد صيام لمدة 8 ساعات.",
                "اختبار وظائف الرئة": "اختبار يقيس كمية الهواء التي يمكن أن يتنفسها الشخص وكمية الهواء التي يمكنه إخراجه.",
                "ارتفاع ضغط الدم": "ارتفاع ضغط الدم، أو فرط ضغط الدم، هو حالة تكون فيها قوة تدفق الدم عبر الشرايين مرتفعة بشكل مستمر، مما يضع ضغطًا زائدًا على جدران الأوعية الدموية ويمكن أن يؤدي إلى مشاكل صحية خطيرة مثل أمراض القلب والسكتة الدماغية.",
                "اقصى معدل ضربات القلب": "  هو أعلى عدد لنبضات القلب يمكن أن يصل إليه الشخص أثناء ممارسة النشاط البدني أو التمارين الرياضية. يُستخدم لتقييم مستوى اللياقة البدنية وقياس الجهد البدنيMaxHR،",
                "الاكتئاب": "مرض الاكتئاب هو اضطراب نفسي شائع يتميز بمشاعر مستمرة من الحزن وفقدان الاهتمام، وقد يؤثر على قدرة الشخص على العمل في حياته اليومية.",
                "الانسولين": "الأنسولين هو هرمون يساعد في تنظيم مستويات السكر في الدم",
                "الانيميا(فقر الدم)": "\"الأنيميا، أو فقر الدم، يمكن أن تظهر بعدة أعراض، منها: الإرهاق (شعور بالتعب المستمر وضعف الطاقة)، شحوب البشرة (قد تبدو البشرة شاحبة أو ذات لون باهت)، ضيق التنفس (شعور بالاختناق أو صعوبة في التنفس عند القيام بأنشطة بسيطة)، دقات قلب سريعة (تسارع في نبض القلب، خاصة أثناء الجهد البدني)، الدوخة أو الدوار (شعور بالدوار أو الإغماء أحياناً)، الصداع (قد يعاني بعض الأشخاص من صداع متكرر)، برودة الأطراف (الشعور بالبرودة في اليدين والقدمين)، وضعف التركيز (صعوبة في التركيز أو الشعور بالارتباك). إذا كنت تعاني من أي من هذه الأعراض، يُفضل استشارة طبيب للتقييم والتشخيص.\"",
                "الباركنسون": "مرض الباركنسون هو اضطراب بالحركة بيأثر على الجهاز العصبي وبيزيد سوء مع الوقت. بيأثر على قدرة الدماغ بالتحكم بالحركة، وبيعمل أعراض مثل الرعشة، التصلب، وصعوبة بالتوازن والتنسيق. ومع مرور الوقت، الأعراض بتسوء أكتر.",
                "التهاب الكبد": "التهاب الكبد هو التهاب في أنسجة الكبد يمكن أن يحدث نتيجة للفيروسات أو أسباب أخرى مثل تناول الكحول بشكل مفرط، بعض الأدوية، أو اضطرابات المناعة الذاتية. هناك أنواع مختلفة من التهاب الكبد، بما في ذلك التهاب الكبد الفيروسي A و B و C.",
                "الجلطة": "الجلطة الإقفارية بتصير لما ينقطع أو يقل تدفق الدم لجزء من الدماغ، وهاد بيمنع خلايا الدماغ من الحصول على الأوكسجين والتغذية. بعد دقائق بتبدأ الخلايا تموت. النوع التاني هو الجلطة النزفية وبتصير لما ينسرب أو ينفجر وعاء دموي بالدماغ، وهاد بيعمل ضغط على خلايا الدماغ وبيأذيها.",
                "الربو": "الربو هو مرض مزمن يؤثر على الشعب الهوائية في الرئتين، مما يؤدي إلى تضييقها وتورمها، ويصاحبه صعوبة في التنفس وسعال وصدور صفير.",
                "الزهايمر": "مرض الزهايمر هو اضطراب عصبي تقدمي يؤدي إلى تدهور وموت خلايا الدماغ، مما يسبب فقدان الذاكرة وتراجع القدرات العقلية وهو اضطراب في الدماغ بيدمر الذاكرة ومهارات التفكير ببطء، وبيؤدي بالنهاية لفقدان القدرة على القيام بالمهام البسيطة",
                "السكري": "مرض السكري هو اضطراب استقلابي يسبب ارتفاع نسبة السكر في الدم نتيجة لعدم كفاية إنتاج الأنسولين أو عدم فعاليته.",
                "القلب": "مرض القلب هو حالة تؤثر على صحة القلب ووظيفته. يمكن أن يشمل مشاكل في الشرايين، مثل تضيقها أو انسدادها، مما يؤدي إلى تقليل تدفق الدم. كما يمكن أن يتسبب في ضعف القلب في ضخ الدم بشكل فعال، مما يؤدي إلى صعوبات في التنفس أو احتباس السوائل. يعد أسلوب الحياة، مثل التغذية والتدخين والنشاط البدني، من العوامل الرئيسية التي تؤثر على الإصابة بأمراض القلب.",
                "الكرياتينين": "الكرياتينين هو ناتج نفايات تنتجه العضلات ويتم ترشيحه من الدم بواسطة الكلى.",
                "الكوليسترول الجيد": "الكوليسترول الجيد هو نوع من الكوليسترول الذي يساعد في إزالة الكوليسترول الضار من الشرايين.",
                "الكوليسترول الضار": "الكوليسترول الضار (LDL) :هو نوع من الكوليسترول الذي يمكن أن يتراكم في الشرايين ويزيد من خطر الإصابة بأمراض القلب.",
                "الهيماتوكريت": "الهيماتوكريت هو نسبة حجم الدم التي تشغلها خلايا الدم الحمراء.",
                "الهيموغلوبين السكري": "الهيموجلوبين السكري (HbA1c) :هو مقياس لمتوسط مستويات السكر في الدم على مدار الشهرين إلى الثلاثة الماضية.",
                "بروتين سي التفاعلي": "بروتين سي التفاعلي (CRP) : هو مؤشر للالتهاب في الجسم.",
                "تركيز الهيموجلوبين في الكريات": " تركيز الهيموجلوبين في الكريات (MCHC) :هو متوسط تركيز الهيموجلوبين في خلايا الدم الحمراء.",
                "خلايا الدم البيضاء": "خلايا الدم البيضاء (WBC) : هي خلايا الجهاز المناعي التي تساعد في مكافحة العدوى.",
                "سكر الدم الصائم": "FastingBS (سكر الدم الصائم) هو قياس لمستوى سكر الجلوكوز في الدم بعد فترة صيام تتراوح عادةً بين 8 ساعات، ويستخدم لتشخيص داء السكري ومراقبة التحكم في سكر الدم.",
                "سكري الحمل": "سكري الحمل هو نوع من السكري يحدث أثناء الحمل وقد يختفي بعد الولادة، لكنه يزيد من خطر الإصابة بالسكري من النوع 2 لاحقًا.",
                "ضغط الدم الانبساطي": "ضغط الدم الانبساطي (DBP) :هو الضغط في الشرايين عندما يكون القلب في حالة راحة بين النبضات.",
                "ضغط الدم الانقباضي": "ضغط الدم الانقباضي (SBP) :هو الضغط في الشرايين عند نبض القلب.",
                "فرط نشاط الغدة الدرقية": "فرط نشاط الغدة الدرقية هو حالة تنتج فيها الغدة الكثير من الهرمونات.",
                "قياس النشاط الكهربائي للقلب": "RestingECG (تخطيط القلب الكهربائي أثناء الراحة) هو اختبار يقيس النشاط الكهربائي للقلب في حالة الراحة، ويهدف إلى تقييم وظيفة القلب، وتشخيص حالات معينة مثل احتشاء عضلة القلب، وتوجيه العلاجات بناءً على النتائج.",
                "قصور الغدة الدرقية": "قصور الغدة الدرقية هو حالة لا تنتج فيها الغدة الدرقية ما يكفي من الهرمونات.",
                "متوسط الهيموجلوبين في الكريات": "متوسط الهيموجلوبين في الكريات (MCH) :هو متوسط كمية الهيموجلوبين في خلايا الدم الحمراء.",
                "متوسط حجم الكريات": "متوسط حجم الكريات (MCV) :هو الحجم المتوسط لخلايا الدم الحمراء.",
                "سرطان الرئة": "سرطان الرئة هو مرض ناتج عن نمو غير طبيعي وغير مسيطر عليه للخلايا في أنسجة الرئة. قد يبدأ السرطان في خلايا الرئة نفسها أو ينتشر إليها من مناطق أخرى في الجسم",
                "سرطان الثدي": "سرطان الثدي هو نوع من السرطان الذي يبدأ في خلايا أنسجة الثدي، عادةً في القنوات (القنوات الحليبية) أو الفصوص (الغدد المنتجة للحليب). يُصيب النساء بشكل رئيسي، لكنه يمكن أن يحدث أيضًا لدى الرجال"

            }
        },
        {
            "tag": "اعراض المرض",
            "patterns": [
                "اعراض الاصابة بمرض [X]؟",
                "اعراض [X]؟",
                "شو علامات الاصابة بمرض [X]؟",
                "شو هيي علامات [X]؟",
                "ما الاعراض الشائعة لمرض [X]؟",
                "ما هي أعراض [X]؟",
                "ماعلامات [X]؟"
            ],
            "slots": {
                "X": [
                    "ارتفاع ضغط الدم",
                    "الاكتئاب",
                    "الباركنسون",
                    "التلاسيميا",
                    "فقر الدم",
                    "التهاب الكبد",
                    "الجلطة",
                    "الربو",
                    "الزهايمر",
                    "السكري",
                    "القلب",
                    "فرط نشاط الغدة الدرقية",
                    "قصور الغدة الدرقية",
                    "نقص الصفائح الدموية",
                    "سرطان الرئة",
                    "سرطان الثدي"
                ]
            },
            "responses": {
                "ارتفاع ضغط الدم": "غالبًا لا يسبب ارتفاع ضغط الدم أعراضًا واضحة في مراحله المبكرة، لذا يُطلق عليه (القاتل الصامت). ولكن في بعض الحالات المتقدمة قد تظهر الأعراض التالية: الصداع الدوخة ضيق التنفس ألم في الصدر مشاكل في الرؤية",
                "الاكتئاب": "تشمل أعراض الاكتئاب مشاعر مستمرة من الحزن، فقدان الاهتمام بالأنشطة، تغيرات في الوزن والشهية، صعوبة في النوم، والتفكير المتكرر بالموت.",
                "فقر الدم": "\"الأنيميا، أو فقر الدم، يمكن أن تظهر بعدة أعراض، منها: الإرهاق (شعور بالتعب المستمر وضعف الطاقة)، شحوب البشرة (قد تبدو البشرة شاحبة أو ذات لون باهت)، ضيق التنفس (شعور بالاختناق أو صعوبة في التنفس عند القيام بأنشطة بسيطة)، دقات قلب سريعة (تسارع في نبض القلب، خاصة أثناء الجهد البدني)، الدوخة أو الدوار (شعور بالدوار أو الإغماء أحياناً)، الصداع (قد يعاني بعض الأشخاص من صداع متكرر)، برودة الأطراف (الشعور بالبرودة في اليدين والقدمين)، وضعف التركيز (صعوبة في التركيز أو الشعور بالارتباك). إذا كنت تعاني من أي من هذه الأعراض، يُفضل استشارة طبيب للتقييم والتشخيص.\"",
                "الباركنسون": "تشمل أعراض مرض باركنسون: أعراض مرض الباركنسون تختلف من شخص لآخر. الأعراض المبكرة قد تكون خفيفة وقد لا يلاحظها أحد. عادةً ما تبدأ الأعراض بجانب واحد من الجسم وتزداد سوءًا مع مرور الوقت. الأعراض الشائعة تشمل: الرعشة، خصوصًا في اليدين أو الأصابع؛ التصلب أو الجمود بالأطراف والجسم؛ البطء في الحركة (bradykinesia)؛ ضعف التوازن والتنسيق؛ تغيرات في الكلام أو الكتابة.",
                "التلاسيميا": "اعراض مرض التلاسيميا تشمل :انخفاض مستويات الهيموجلوبين، انخفاض مستويات خلايا الدم الحمراء، وأحياناً نتائج غير طبيعية في اختبار حجم الكريات الحمراء (Mean Corpuscular Volume) ونسبة الهيموجلوبين في الكريات الحمراء (Mean Corpuscular Hemoglobin Concentration).",
                "التهاب الكبد": "تختلف أعراض التهاب الكبد حسب نوعه ومرحلته، ولكن تشمل الأعراض الشائعة: اليرقان (اصفرار الجلد والعينين) التعب والإرهاق فقدان الشهية الغثيان والقيء ألم في الجزء العلوي الأيمن من البطن البول الداكن البراز الفاتح.",
                "الجلطة": "أعراض مرض الجلطة: تختلف حسب نوع الجلطة، حيث تشمل الجلطة الإقفارية (Ischemic Stroke) ضعف أو شلل في الوجه أو الأطراف وصعوبة في الكلام وفقدان الرؤية، بينما تتضمن الجلطة النزفية (Hemorrhagic Stroke) صداعًا شديدًا مفاجئًا وغثيانًا وتغييرات في مستوى الوعي، أما النوبة الإقفارية العابرة (TIA) فتعطي أعراضًا مشابهة للإقفارية ولكنها تختفي سريعًا.",
                "الربو": "تشمل أعراض الربو الشائعة ضيق التنفس، السعال المتكرر خاصة أثناء الليل أو في الصباح الباكر، الصفير أثناء التنفس، وضيق في الصدر.",
                "الزهايمر": "أعراض الزهايمر تشمل فقدان الذاكرة، الارتباك، صعوبة بالكلام والفهم، تغيرات بالشخصية، وصعوبة بإنجاز المهام المعتادة, الأعراض المبكرة بتتضمن النسيان وصعوبة تذكر الأحداث الأخيرة. ومع تطور المرض، الأعراض ممكن تشمل الارتباك، تقلبات المزاج، وصعوبة بالتواصل.",
                "السكري": "تشمل أعراض مرض السكري: العطش الشديد، كثرة التبول، الجوع المستمر، فقدان الوزن غير المبرر، الإرهاق، وضبابية الرؤية.",
                "القلب": "تشمل أعراض مرض القلب: ألم في الصدر، ضيق في التنفس، تعب، ودوخة. قد يشعر المريض بألم في الصدر (مثل الذبحة الصدرية أو ألم غير مرتبط بالذبحة)، وقد يظهر الألم بشكل متقطع أو مستمر. الأعراض قد تختلف من شخص لآخر.",
                "فرط نشاط الغدة الدرقية": "تشمل اعراض فرط نشاط الغدة الدرقية : فقدان الوزن غير المبرر، وتسارع ضربات القلب، والتعرق المفرط، والقلق.",
                "قصور الغدة الدرقية": "تشمل اعراض قصور الغدة الدرقية : الشعور بالإرهاق، زيادة الوزن، تساقط الشعر، بطء ضربات القلب، وجفاف الجلد.",
                "نقص الصفائح الدموية": "\"نقص الصفائح الدموية (Thrombocytopenia) هو حالة تتميز بانخفاض عدد الصفائح الدموية في الدم، مما قد يؤدي إلى الكدمات (ظهور كدمات على الجسم بدون سبب واضح)، نزيف غير عادي (مثل نزيف الأنف أو نزيف اللثة)، بقع حمراء صغيرة على الجلد (تعرف باسم بيتيشيا نتيجة نزيف تحت الجلد)، فترة نزيف أطول عند الجروح، وضعف عام أو تعب. إذا كنت تعاني من أي من هذه الأعراض، من المهم استشارة طبيب للحصول على التشخيص المناسب والعلاج إذا لزم الأمر.\"",
              "سرطان الرئة": "سعال مستمر لا يختفي أو يزداد سوءًا بمرور الوقت، سعال مصحوب بالدم أو بلغم داكن، ضيق في التنفس خاصة أثناء النشاط البدني، صفير في الصدر أو صوت خشن أثناء التنفس",
               "سرطان الثدي": "كتلة في الثدي أو تحت الإبط، قد تكون غير مؤلمة وغالبًا ما تُكتشف باللمس، تغير في شكل أو حجم الثدي، تغير في ملمس الجلد مثل ظهور نتوءات أو تجاعيد (يشبه قشر البرتقال)، حلمة مقلوبة أو مسحوبة إلى الداخل، إفرازات غير طبيعية من الحلمة قد تكون شفافة أو دموية، احمرار أو تقرحات في جلد الثدي، تورم أو سخونة في منطقة الثدي"


            }
        },
        {
            "tag": "علاج المرض",
            "patterns": [
                " كيف اعالج [X]؟",
                " ما هو علاج [X]؟",
                "شلون منعالج [X]؟",
                "شو علاج [X]؟",
                "هل يوجد علاج ل[X]؟",
                "ما هي الطرق العلاجية ل [X]؟"
            ],
            "slots": {
                "X": [
                    "ارتفاع ضغط الدم",
                    "الاكتئاب",
                    "الباركنسون",
                    "التهاب الكبد",
                    "الجلطة",
                    "الربو",
                    "الزهايمر",
                    "السكري",
                    "القلب",
                    "فرط نشاط الغدة الدرقية",
                    "قصور الغدة الدرقية",
                    "فقر الدم",
                    "سرطان الرئة",
                    "سرطان الثدي"
                ]
            },
            "responses": {
                "ارتفاع ضغط الدم": "تشمل طرق علاج ارتفاع ضغط الدم: تغييرات في نمط الحياة مثل تقليل تناول الملح، وممارسة الرياضة بانتظام، والتوقف عن التدخين. تناول الأدوية الموصوفة من قبل الطبيب مثل مدرات البول، وحاصرات قنوات الكالسيوم، ومثبطات الإنزيم المحول للأنجيوتنسين.",
                "الاكتئاب": "علاج الاكتئاب يتضمن :العلاج النفسي، تناول الأدوية المضادة للاكتئاب، وإجراء تغييرات في نمط الحياة مثل ممارسة الرياضة .",
                "الباركنسون": "علاج مرض الباركنسون يشمل :لا يوجد علاج نهائي لمرض الباركنسون، ولكن هناك علاجات تساعد في إدارة الأعراض. العلاجات الشائعة تشمل الأدوية مثل Levodopa للتحكم بأعراض الحركة، تحفيز الدماغ العميق (DBS) وهو إجراء جراحي، العلاج الطبيعي لتحسين التوازن والمرونة، والعلاج الوظيفي للمساعدة في الأنشطة اليومية.",
                "التهاب الكبد": "التهاب الكبد B ليس له علاج نهائي، ولكن يمكن التحكم فيه باستخدام الأدوية المضادة للفيروسات. أما التهاب الكبد C، فيمكن علاجه باستخدام أدوية مضادة للفيروسات حديثة تؤدي إلى شفاء معظم المرضى.",
                "الجلطة": "علاج الجلطة: يعتمد على نوع الجلطة وموقعها، ويشمل استخدام مضادات التخثر مثل الوارفارين والهيبارين، والأدوية المسيلة للدم مثل الأسبرين، بالإضافة إلى أدوية مُذيبة للجلطات مثل الألتبلاز، وفي بعض الحالات قد تُجرى عمليات لإزالة الجلطة، كما يحتاج المريض للعلاج الطبيعي لاستعادة الحركة، ويُفضل إجراء تغييرات في نمط الحياة مثل ممارسة التمارين الرياضية، وتناول غذاء صحي، والإقلاع عن التدخين للوقاية من الجلطات المستقبلية.",
                "الربو": "تشمل أدوية الربو موسعات الشعب الهوائية السريعة المفعول لتخفيف الأعراض الفورية، وأدوية التحكم الطويلة الأجل مثل الستيرويدات المستنشقة لمنع حدوث النوبات.",
                "الزهايمر": "ما في علاج نهائي لمرض الزهايمر، بس العلاجات بتساعد على إدارة الأعراض. الأدوية مثل مثبطات الكولينستراز بتساعد على الحفاظ على الوظائف العقلية لفترة قصيرة, الأطباء غالباً بيصفوا أدوية لتبطيء تقدم الأعراض، والعلاجات المساندة مثل التدريب العقلي والعلاج ممكن تكون مفيدة.",
                "السكري": "علاج السكري : يتضمن تناول الأدوية مثل الأنسولين، اتباع نظام غذائي صحي، ممارسة الرياضة بانتظام، ومراقبة مستوى السكر في الدم باستمرار.",
                "القلب": "علاج مرض القلب : يشمل الأدوية لتقليل ضغط الدم والكوليسترول، تغييرات في نمط الحياة مثل تحسين النظام الغذائي والتمارين، وفي بعض الحالات الجراحة مثل تركيب الدعامات أو إجراء جراحة القلب المفتوح لعلاج انسداد الشرايين.",
                "فرط نشاط الغدة الدرقية": "تشمل خيارات العلاج الأدوية المضادة للغدة الدرقية، والعلاج باليود المشع، أو الجراحة في بعض الحالات.",
                "قصور الغدة الدرقية": "يشمل علاج قصور الغدة الدرقية تناول هرمونات صناعية مثل ليفوثيروكسين لتعويض النقص.",
                "فقر الدم": "علاج فقر الدم يعتمد على السبب الكامن وراءه. في حالة فقر الدم الناتج عن نقص الحديد، يتم تناول مكملات الحديد مع تحسين التغذية عبر تناول الأطعمة الغنية بالحديد مثل اللحوم الحمراء، الدواجن، الأسماك، والبقوليات. إذا كان السبب نقص فيتامين B12 أو حمض الفوليك، يتم تناول المكملات المناسبة لهذه الفيتامينات، بالإضافة إلى تناول الأطعمة التي تحتوي عليها مثل اللحوم، الألبان، والخضروات الورقية. في بعض الحالات التي تتعلق بالأمراض المزمنة أو اضطرابات الدم، قد يتطلب العلاج تدخلات طبية مثل الأدوية الخاصة أو العلاج الكيميائي. إذا كان فقر الدم ناتجًا عن فقدان الدم، فإن معالجة النزيف أو إجراء الجراحة قد يكون ضرورياً. في حالات نادرة، قد يحتاج الشخص إلى نقل دم إذا كانت الأعراض شديدة.",
                "سرطان الرئة": "الجراحة,العلاج الإشعاعي,العلاج الكيميائي,العلاج الموجه",
                "سرطان الثدي": "الجراحة,العلاج الإشعاعي,العلاج الكيميائي,العلاج الهرموني,العلاج الموجه,العلاج المناعي"

            }
        },
        {
            "tag": "الوقاية من المرض",
            "patterns": [
                "شو النصائح للوقاية من [X]؟",
                "كيف بحمي نفسي من [X]",
                "طرق الوقاية من [X]؟",
                "كيف نحمي نفسنا من [X]؟",
                "كيف ممكن احمي حالي من [X]؟",
                "كيف يمكن الوقاية من [X]؟",
                "ما هي الطرق الوقائية من [X]؟"
            ],
            "slots": {
                "X": [
                    "ارتفاع ضغط الدم",
                    "الاكتئاب",
                    "الباركنسون",
                    "التهاب الكبد",
                    "الجلطة",
                    "الربو",
                    "الزهايمر",
                    "السكري",
                    "القلب",
                    "فقر الدم",
                    "فرط نشاط الغدة الدرقية",
                    "قصور الغدة الدرقية",
                    "سرطان الرئة",
                    "سرطان الثدي"
                ]
            },
            "responses": {
                "ارتفاع ضغط الدم": "للوقاية من ارتفاع ضغط الدم: الحفاظ على وزن صحي ممارسة الرياضة بانتظام اتباع نظام غذائي صحي يحتوي على الفواكه والخضروات ويقلل من الصوديوم تقليل تناول الكحول والتوقف عن التدخين إدارة التوتر والقلق بشكل صحي",
                "الاكتئاب": "يمكن الوقاية من الاكتئاب من خلال الحفاظ على توازن صحي بين العمل والحياة، ممارسة الرياضة بانتظام، وتقوية الدعم الاجتماعي.",
                "الباركنسون": "يمكن الوقاية من مرض باركنسون: اتباع نظام غذائي غني بمضادات الأكسدة، ممارسة النشاط البدني بانتظام، الحفاظ على صحة الدماغ من خلال الأنشطة الذهنية، وتجنب التعرض للسموم مثل المبيدات والمعادن الثقيلة. على الرغم من أن هذه الخطوات لا تضمن الوقاية، إلا أنها تساهم في تعزيز صحة الجهاز العصبي بشكل عام.",
                "التهاب الكبد": "للوقاية من التهاب الكبد: الحصول على اللقاح ضد التهاب الكبد A و B تجنب مشاركة الأدوات الحادة مثل الإبر استخدام وسائل الحماية الجنسية ضمان تعقيم الأدوات الطبية.",
                "الجلطة": "يمكن الوقاية من الجلطة : من خلال اتباع نمط حياة صحي يتضمن تناول غذاء متوازن غني بالفواكه والخضروات، وممارسة التمارين الرياضية بانتظام، والإقلاع عن التدخين، وإدارة الوزن، ومراقبة ضغط الدم ومستويات الكوليسترول، والسيطرة على مرض السكري، وشرب السوائل الكافية، وتجنب الجلوس لفترات طويلة، بالإضافة إلى استشارة الطبيب إذا كانت لديك عوامل خطر مرتفعة للحصول على أدوية وقائية.",
                "الربو": "الوقاية من مرض الربو تتضمن تجنب المحفزات مثل الدخان والمواد المسببة للحساسية، والتخلص من العوامل المهيجة باستخدام مرشحات الهواء، وتجنب ممارسة الرياضة في الطقس البارد، والحفاظ على وزن صحي، والتحكم في حالات صحية أخرى مثل الحساسية والتهاب الجيوب الأنفية، والحصول على التطعيمات المناسبة، والتخطيط لممارسة بدنية آمنة، واستشارة الطبيب بانتظام لمراقبة الحالة وضبط العلاج عند الحاجة.",
                "الزهايمر": "ما في طريقة مؤكدة للوقاية من الزهايمر، بس المحافظة على نمط حياة صحي مع ممارسة التمارين الرياضية بانتظام، اتباع نظام غذائي متوازن، والتحفيز العقلي ممكن يساعدوا بتقليل الخطر, الأبحاث بتشير إلى أن النظام الغذائي الصحي، النشاط البدني المنتظم، والبقاء نشط عقلياً ممكن يقلل من خطر الإصابة بالزهايمر .",
                "السكري": "يمكن الوقاية من مرض السكري : من خلال الحفاظ على وزن صحي، ممارسة النشاط البدني بانتظام، تناول طعام صحي، وتقليل استهلاك السكر والدهون المشبعة.",
                "القلب": "الوقاية من مرض القلب تشمل الحفاظ على نمط حياة صحي من خلال تناول غذاء متوازن، ممارسة النشاط البدني بانتظام، تجنب التدخين، والتحكم في مستويات ضغط الدم والكوليسترول والسكري.",
                "فقر الدم": "الوقاية من فقر الدم تتطلب اتباع بعض العادات الصحية والنظام الغذائي المتوازن. من أهم طرق الوقاية هي تناول الأطعمة الغنية بالحديد مثل اللحوم الحمراء، الكبد، الدواجن، الأسماك، البقوليات، والمكسرات. كما يجب تناول الأطعمة الغنية بفيتامين B12 مثل اللحوم، الألبان، والبيض، بالإضافة إلى الخضروات الورقية التي تحتوي على حمض الفوليك. تجنب تناول الأطعمة التي تعيق امتصاص الحديد مثل الشاي والقهوة مع الوجبات. من المهم أيضًا متابعة الحالة الصحية بشكل دوري للكشف المبكر عن أي نقص أو مشكلة صحية. النساء الحوامل يجب أن يتناولن المكملات الغذائية الموصى بها لتعويض احتياجاتهن من الحديد والفوليك أسيد",
                "فرط نشاط الغدة الدرقية": "للوقاية من فرط نشاط الغدة الدرقية، يُنصح بتناول نظام غذائي متوازن، وتقليل الإجهاد، ومراقبة وظائف الغدة الدرقية، وتجنب المواد المثيرة مثل الكافيين والتدخين، مع الاهتمام بالصحة العامة.",
                "قصور الغدة الدرقية": "للوقاية من قصور الغدة الدرقية، يُنصح باتباع نظام غذائي متوازن يحتوي على اليود والسيلينيوم، والحفاظ على وزن صحي، وممارسة النشاط البدني بانتظام، وإجراء فحوصات دورية لوظائف الغدة الدرقية، وتجنب التعرض للمواد الكيميائية الضارة، مع الاهتمام بالصحة النفسية والتقليل من الإجهاد.",
                "سرطان الرئة": "الإقلاع عن التدخين: يعد التدخين السبب الرئيسي لسرطان الرئة، الإقلاع عن التدخين يقلل بشكل كبير من خطر الإصابة، تجنب التعرض للملوثات البيئية: تقليل التعرض لغاز الرادون الذي يمكن قياس مستوياته في المنازل، تجنب استنشاق مواد سامة مثل الأسبستوس أو الملوثات الكيميائية، اتباع نظام غذائي صحي: تناول أطعمة غنية بالخضروات والفواكه التي تحتوي على مضادات الأكسدة، الحفاظ على النشاط البدني: ممارسة التمارين الرياضية بانتظام لدعم صحة الجهاز التنفسي والجسم عمومًا، الفحوص الدورية: إجراء فحوص دورية للأشخاص المعرضين للخطر خاصة المدخنين أو الذين لديهم تاريخ عائلي للمرض، تجنب التدخين السلبي: الابتعاد عن الأماكن التي يتعرض فيها الشخص لدخان التبغ.",
                "سرطان الثدي": "اتباع نمط حياة صحي: الحفاظ على وزن صحي لتجنب السمنة التي تعد عامل خطر للإصابة بسرطان الثدي، ممارسة التمارين الرياضية بانتظام، الرضاعة الطبيعية: الرضاعة الطبيعية تقلل من خطر الإصابة بسرطان الثدي، تقليل استهلاك الكحول: الحد من تناول المشروبات الكحولية يقلل من خطر الإصابة، التوازن الهرموني: تجنب العلاج الهرموني طويل الأمد بعد انقطاع الطمث إلا إذا كان ضروريًا وبإشراف طبي، إجراء الفحوص الدورية: الفحص الذاتي للثدي مرة شهريًا، الخضوع لفحص الماموجرام (تصوير الثدي بالأشعة) بانتظام خاصة للنساء فوق سن 40 أو لمن لديهن تاريخ عائلي"

            }
        },
        {
            "tag": "عوامل الخطر للمرض ",
            "patterns": [
                "ما الذي يزيد خطر الإصابة بمرض [X]",
                "ما هو سبب [X]",
                "ما هي عوامل الخطر لمرض [X]"
            ],
            "slots": {
                "X": [
                    "الاكتئاب",
                    "الربو",
                    "الزهايمر",
                    "السكري",
                    "القلب",
                    "فرط نشاط الغدة الدرقية",
                    "قصور الغدة الدرقية",
                    "التهاب الكبد",
                    "الباركنسون",
                    "الربو",
                    "رتفاع ضغط الدم",
                    "فقر الدم",
                    "سرطان الرئة",
                    "سرطان الثدي"
                ]
            },
            "responses": {
                "الاكتئاب": "تشمل عوامل الخطر للاكتئاب: تاريخ عائلي من الاكتئاب، صدمات نفسية، ضغوط حياتية كبيرة، وتغيرات هرمونية.",
                "الربو": "تشمل العوامل التي تزيد من سوء الربو التعرض لدخان السجائر، الهواء الملوث، المواد المسببة للحساسية مثل الغبار أو العفن، التمارين البدنية المجهدة، والبرد.",
                "الزهايمر": "عوامل الخطر لمرض الزهايمر تشمل العمر، التاريخ العائلي، الجينات، صحة القلب والأوعية الدموية الضعيفة، والإصابات الدماغية, العمر المتقدم والجينات عوامل خطورة كبيرة، بس نمط الحياة مثل النظام الغذائي والتمارين الرياضية كمان ممكن يأثروا على الخطر.",
                "السكري": "تشمل عوامل الخطر لمرض السكري : السمنة، قلة النشاط البدني، التاريخ العائلي للسكري، والعمر المتقدم. أيضاً، النظام الغذائي غير الصحي قد يزيد من خطر الإصابة.",
                "القلب": "عوامل الخطر لمرض القلب تشمل :ارتفاع ضغط الدم، ارتفاع مستويات الكوليسترول، التدخين، السكري، زيادة الوزن، وعدم ممارسة النشاط البدني بانتظام",
                "فرط نشاط الغدة الدرقية": "العوامل الجينية (تاريخ عائلي للإصابة) داء غريفز (اضطراب مناعي يهاجم الغدة) التهاب الغدة الدرقية (بسبب العدوى أو المناعة الذاتية) عقيدات الغدة الدرقية (أورام أو تكيسات تسبب إفرازًا زائدًا) زيادة اليود في الغذاء أو الأدوية (يحفز إفراز الهرمونات) تناول كميات كبيرة من هرمونات الغدة الدرقية (أدوية أو مكملات) الأورام النادرة (في الغدة النخامية أو المبايض).",
                "قصور الغدة الدرقية": "نقص اليود (ضروري لإنتاج الهرمونات) التهاب الغدة الدرقية (مثل التهاب هاشيموتو المناعي) العوامل الجينية (تاريخ عائلي للإصابة) استئصال الغدة الدرقية (جراحيًا أو بسبب العلاج باليود المشع) بعض الأدوية (مثل الليثيوم أو الأميودارون) اضطرابات الغدة النخامية (ضعف تحفيز الغدة الدرقية) التعرض للإشعاع (للعلاج أو لأسباب بيئية)",
                "التهاب الكبد": "العدوى الفيروسية (مثل فيروسات التهاب الكبد A وB وC وD وE) الإفراط في تناول الكحول (يؤدي إلى التهاب وتلف الكبد) السموم (مثل بعض المواد الكيميائية أو الأدوية) أمراض المناعة الذاتية (عندما يهاجم الجهاز المناعي الكبد) تراكم الدهون في الكبد (الكبد الدهني غير الكحولي) العدوى البكتيرية أو الطفيلية (مثل البلهارسيا أو الزهري) بعض الأمراض الوراثية (مثل داء ويلسون أو داء ترسب الأصبغة الدموية).",
                "الباركنسون": "العوامل الجينية (طفرات جينية وتاريخ عائلي) العوامل البيئية (التعرض للسموم مثل المبيدات والمعادن الثقيلة) الشيخوخة (فقدان طبيعي للخلايا العصبية مع التقدم في العمر) الإجهاد التأكسدي والالتهابات (يسبب تلف الخلايا العصبية) اختلال البروتينات (تراكم بروتين الألفا-سينوكلين) ضعف الميتوكوندريا (يعيق إنتاج الطاقة في الخلايا) اضطرابات الجهاز المناعي (هجمات مناعية على الخلايا العصبية)",
                "ارتفاع ضغط الدم": "التاريخ العائلي (العوامل الوراثية) السمنة (زيادة الوزن تضغط على الأوعية الدموية) تناول كميات زائدة من الملح (يزيد احتباس السوائل) قلة النشاط البدني (تضعف مرونة الأوعية الدموية) التدخين (يضر بجدران الأوعية ويضيقها) التوتر المزمن (يرفع هرمونات الضغط) الإفراط في استهلاك الكحول (يؤثر على الكلى والقلب) بعض الأمراض المزمنة (مثل أمراض الكلى أو السكري) اضطرابات هرمونية (مثل فرط نشاط الغدة الكظرية).",
                "فقر الدم": "فقر الدم يحدث عندما تنخفض مستويات الهيموجلوبين في الدم، مما يقلل من قدرة الجسم على نقل الأوكسجين. من أسباب فقر الدم الشائعة نقص الحديد، الذي يعد عنصراً أساسياً في تكوين الهيموجلوبين. كما يمكن أن يؤدي نقص الفيتامينات مثل فيتامين B12 وحمض الفوليك إلى هذه الحالة. الأمراض المزمنة مثل أمراض الكلى والسرطان قد تؤثر أيضاً على إنتاج خلايا الدم الحمراء. بالإضافة إلى ذلك، يمكن أن يؤدي فقدان الدم المزمن أو الحاد، مثل النزيف الناتج عن الحيض الغزير أو الإصابة، إلى فقر الدم. بعض الاضطرابات الوراثية مثل فقر الدم المنجلي والثلاسيميا تؤدي أيضاً إلى تكسر خلايا الدم الحمراء بسرعة. المشاكل في نخاع العظام أو بعض الأورام قد تؤثر على قدرة الجسم في إنتاج خلايا الدم. خلال الحمل، يزداد احتياج الجسم للحديد والفوليك أسيد، مما قد يؤدي إلى فقر الدم إذا لم يتم تلبية هذه الحاجة. التسمم بالرصاص والتغذية غير المتوازنة أيضاً يمكن أن تساهم في حدوث فقر الدم.",
                "سرطان الرئة": "التدخين: يعد التدخين السبب الرئيسي لسرطان الرئة. الأشخاص الذين يدخنون أو تعرضوا لدخان التبغ (التدخين السلبي) يكونون أكثر عرضة للإصابة، التعرض للملوثات البيئية: التعرض للمواد السامة مثل الأسبستوس (الأميانت) والمواد الكيميائية في بيئة العمل أو المنزل، التعرض للهواء الملوث في بعض المناطق، غاز الرادون: الرادون هو غاز مشع يمكن أن يتسرب من الأرض إلى المنازل والمباني، مما يزيد من خطر الإصابة بسرطان الرئة، التاريخ العائلي: وجود تاريخ عائلي للإصابة بسرطان الرئة يمكن أن يزيد من خطر الإصابة، العمر: خطر الإصابة بسرطان الرئة يزداد مع التقدم في السن، خاصةً بعد سن 50",
                "سرطان الثدي": "النساء فوق سن 50 هن أكثر عرضة للإصابة بسرطان الثدي، التاريخ العائلي: وجود تاريخ عائلي من الإصابة بسرطان الثدي يزيد من احتمال الإصابة، الطفرات الجينية: وجود طفرات جينية مثل BRCA1 وBRCA2 يزيد من خطر الإصابة، التعرض لهرمونات عالية: العلاج الهرموني طويل الأمد بعد انقطاع الطمث أو تناول هرمونات في فترة ما قبل انقطاع الطمث يزيد من خطر الإصابة، التدخين والكحول: التدخين واستهلاك الكحول بشكل مفرط يزيدان من خطر الإصابة بسرطان الثدي، السمنة: النساء اللواتي يعانين من السمنة، خاصة بعد انقطاع الطمث، هن أكثر عرضة للإصابة بسرطان الثدي، الرضاعة الطبيعية: النساء اللواتي لم يرضعن طبيعيًا قد يكون لديهن خطر أكبر للإصابة بسرطان الثدي"

            }
        },
        {
            "tag": "تشخيص المرض",
            "patterns": [
                "تشخيص [X]",
                "كيف بعرف انو معي [X]",
                "كيف اعرف اني مصاب ب [X]",
                "كيف بكشف الاصابة ب [X]",
                "كيف الطبيب بيعرف انو معي [X]",
                "كيف الاطباء تشخص [X]",
                "كيف بيتم تشخيص [X]",
                "ما هي الفحوصات لتشخيص [X]"
            ],
            "slots": {
                "X": [
                    "ارتفاع ضغط الدم",
                    "الاكتئاب",
                    "الباركنسون",
                    "التهاب الكبد",
                    "الجلطة",
                    "الربو",
                    "فقر الدم",
                    "الزهايمر",
                    "السكري",
                    "القلب",
                    "فرط نشاط الغدة الدرقية",
                    "قصور الغدة الدرقية",
                    "سرطان الرئة",
                    "سرطان الثدي"
                ]
            },
            "responses": {
                "ارتفاع ضغط الدم": "يتم تشخيص ارتفاع ضغط الدم باستخدام جهاز قياس ضغط الدم، والذي يقيس الضغط الانقباضي (أعلى رقم) والضغط الانبساطي (أدنى رقم). يُعتبر ضغط الدم مرتفعًا إذا كانت القراءة تزيد عن 140/90 مم زئبق.",
                "الاكتئاب": "يتم تشخيص الاكتئاب من خلال أخذ التاريخ الطبي والنفسي، وإجراء الفحص البدني، واستخدام استبيانات تقييم الاكتئاب، بالإضافة إلى التقييم النفسي لاستبعاد الحالات الطبية الأخرى.",
                "الباركنسون": "مرض الباركنسون بيتشخص من خلال التاريخ المرضي للشخص، مراجعة الأعراض والفحص العصبي والبدني. الفحوصات التصويرية مثل الرنين المغناطيسي أو التصوير المقطعي ممكن تستخدم لاستبعاد أمراض تانية. بالإضافة لفحص DaTscan اللي بفحص جهاز الدوبامين بالدماغ للمساعدة بتأكيد التشخيص.",
                "التهاب الكبد": "يتم تشخيص مرض الكبد من خلال تقييم المؤشرات البيوكيميائية مثل مستويات ALB وALT وGGT، حيث يعكس ALB قدرة الكبد على إنتاج البروتينات الضرورية، وترتفع مستويات ALT وAST عادةً في حالة تلف الكبد مما يشير إلى التهاب أو تضرر خلاياه، بينما يُعتبر GGT مؤشرًا على مشاكل القنوات الصفراوية أو اضطرابات الكبد المرتبطة بالكحول.",
                "الجلطة": "تشخيص الجلطة بيتم باستخدام عدة فحوصات:\n- **الفحص السريري**: الطبيب بيقيم الأعراض مثل الضعف أو تغيرات في الرؤية والكلام.\n- **التصوير بالرنين المغناطيسي (MRI)** أو **التصوير المقطعي (CT)**: لتحديد موقع الجلطة وحجم الضرر.\n- **اختبارات الدم**: لتقييم مستويات الجلوكوز والكوليسترول، وأيضًا لتحديد اضطرابات الدم.\n- **تصوير الأوعية الدموية**: لرؤية الشرايين المتضيقة أو المسدودة.\n- **اختبار القلب**: لتقييم صحة القلب والتأكد من عدم وجود مشاكل قد تكون سببًا للجلطة.",
                "الربو": "يتم تشخيص مرض الربو من خلال أخذ التاريخ الطبي، والفحص البدني، واختبارات وظائف الرئة مثل السبيرومترية، واختبارات تحريض الربو، واختبارات الحساسية، بالإضافة إلى الأشعة السينية للصدر وقياس نسبة أكسيد النيتريك في الزفير.",
                "فقر الدم": "تشخيص فقر الدم يبدأ بسؤال الطبيب عن الأعراض مثل التعب، الشحوب، أو الدوار، بالإضافة إلى استفسار عن العوامل المحتملة مثل التغذية أو مشاكل صحية أخرى. ثم يقوم الطبيب بإجراء فحص بدني للتحقق من وجود علامات لفقر الدم مثل شحوب الجلد أو تسارع ضربات القلب. يعتمد التشخيص الأساسي على تحليل الدم، وأهمها تحليل تعداد الدم الكامل (CBC) الذي يقيس مستويات الهيموجلوبين وعدد خلايا الدم الحمراء. بالإضافة إلى ذلك، يتم قياس مستويات الحديد في الدم لتحديد إذا كان هناك نقص فيه. كما يتم قياس فيتامين B12 وحمض الفوليك للتحقق من نقص هذه الفيتامينات. في بعض الحالات، قد يطلب الطبيب اختبارات إضافية مثل فحص وظائف الكبد أو الكلى أو فحوصات خاصة للكشف عن أمراض وراثية أو مزمنة تسبب فقر الدم.",
                "الزهايمر": "بيتم تشخيص الزهايمر من خلال مزيج من التاريخ الطبي، اختبارات القدرات العقلية، التصوير الدماغي، وأحياناً التحاليل الجينية, الأطباء بيستخدموا تقييمات عقلية، تصوير للدماغ، وتحاليل دم عشان يستبعدوا حالات تانية ويشخصوا الزهايمر.",
                "السكري": "يتم تشخيص مرض السكري عبر اختبارات الدم مثل اختبار الجلوكوز الصيامي، اختبار التحمل الجلوكوز، واختبار HbA1c.",
                "القلب": "يتم تشخيص مرض القلب من خلال التاريخ الطبي والفحص البدني واختبارات الدم وتخطيط القلب الكهربائي والأشعة السينية والتصوير بالأشعة المقطعية أو الرنين المغناطيسي واختبار الجهد وتصوير القلب بالموجات فوق الصوتية والقسطرة.",
                "فرط نشاط الغدة الدرقية": "يتم تشخيص فرط نشاط الغدة الدرقية من خلال اختبارات دم تقيس مستويات TSH و T4 و T3.",
                "قصور الغدة الدرقية": "يتم تشخيص قصور الغدة الدرقية من خلال اختبارات دم تقيس مستويات TSH و T4.",
                "سرطان الرئة": "\nالتاريخ الطبي والفحص السريري: استعراض الأعراض والتاريخ الطبي، بما في ذلك عادات التدخين أو التعرض لمواد خطرة، الفحص السريري للكشف عن علامات مثل ضيق التنفس أو تورم الغدد الليمفاوية، الفحوص التصويرية: الأشعة السينية على الصدر (Chest X-ray): قد تظهر كتلة أو تغيرات غير طبيعية، التصوير المقطعي المحوسب (CT Scan): يوفر صورًا تفصيلية عن الرئتين للكشف عن الأورام الصغيرة، اختبارات المخاط أو البلغم: تحليل البلغم (Sputum Cytology): فحص عينة من البلغم تحت المجهر للكشف عن الخلايا السرطانية، اختبارات أخذ عينات الأنسجة: الخزعة (Biopsy): أخذ عينة من الأنسجة من منطقة مشبوهة لفحصها مجهريًا، الخزعة بالإبرة الدقيقة (Fine-Needle Aspiration): لإزالة عينة صغيرة من الأنسجة أو السوائل، تنظير القصبات (Bronchoscopy): استخدام أنبوب مرن لرؤية الرئتين من الداخل وأخذ عينات، اختبارات إضافية: اختبار وظائف الرئة: لتقييم مدى تأثير المرض على التنفس، اختبارات الدم: للكشف عن العلامات البيولوجية المرتبطة بسرطان الرئة",
                "سرطان الثدي": "الفحص الذاتي للكشف عن أي كتل أو تغيرات غير طبيعية في الثدي، الفحص السريري من قبل طبيب لتحديد الحاجة لمزيد من الاختبارات، التصوير الإشعاعي: الماموجرم (Mammogram): أشعة سينية للثدي تُستخدم للكشف عن الكتل أو التكلسات الدقيقة، التصوير بالموجات فوق الصوتية (Ultrasound): يستخدم لتحديد طبيعة الكتل (صلبة أو كيسية)، التصوير بالرنين المغناطيسي (MRI): يقدم صورًا مفصلة للأنسجة للكشف عن الأورام غير المرئية بالماموجرام، الخزعة (Biopsy): أخذ عينة من الأنسجة المشتبه بها لفحصها تحت المجهر، الأنواع: الخزعة بالإبرة الدقيقة (Fine-Needle Biopsy)، الخزعة الأساسية (Core Biopsy)، الخزعة الجراحية"

            }
        },
         {
            "tag": "التحية",
            "patterns": [
                     "مرحبا [X]",
                     "السلام عليكم [X]",
                     "صباح الخير [X]",
                     "مسا الخير [X]",
                     "اريد المساعدة [X]"
            ],
            "slots": {
                "X": [
                     "مرحبا",
                     "السلام عليكم",
                     "صباح الخير",
                     "مسا الخير",
                     "اريد المساعدة"
                ]
            },
            "responses": {
                    "مرحبا": "مرحبا! كيف فيني أساعدك اليوم؟",
                    "السلام عليكم": "السلام عليكم! شو ممكن أقدم لك؟",
                    "صباح الخير": "صباح النور ! شو بتحب ساعدك؟",
                    "مسا الخير": "مساء النور! شو فيني ساعدك؟",
                    "اريد المساعدة": "تفضل! نحن هنا لمساعدتك"
            }
        },
        {
            "tag": "انواع المرض",
            "patterns": [
                " الفروقات بين انواع [X]",
                "شو هي أنواع [X] بالتفصيل؟",
                "كم نوع يوجد لمرض [X]",
                "شو هوي الفرق بين أنواع [X]",
                "شوهي أنواع [X]",
                "أنواع [X]"
            ],
            "slots": {
                "X": [
                    "الانسولين",
                    "التهاب الكبد",
                    "السكري",
                    "سرطان الرئة",
                    "سرطان الثدي"
                ]
            },
            "responses": {
                "الانسولين": "تشمل الأنواع الأنسولين السريع المفعول، الأنسولين المتوسط المفعول، والأنسولين طويل المفعول.",
                "التهاب الكبد": "هناك عدة أنواع منها: التهاب الكبد الفيروسي A، B، C، D، وE. النوع B وC يمكن أن يؤدي إلى التهاب كبد مزمن.",
                "السكري": "يوجد نوعان رئيسيان لمرض السكري: النوع الأول الذي يعتمد على الأنسولين، والنوع الثاني الذي يعتمد على نمط الحياة والنظام الغذائي. هناك أيضًا حالة تُسمى سكري الحمل التي تحدث أثناء الحمل.",
                "سرطان الرئة": "سرطان الرئة ذو الخلايا الصغيرة (SCLC): يتميز بسرعة نموه وانتشاره.\nسرطان الرئة غير صغير الخلايا (NSCLC): أكثر الأنواع شيوعًا، وينقسم إلى أنواع فرعية، مثل السرطان الغدي والسرطان الحرشفي",
                "سرطان الثدي": "سرطان القنوات الغازي (IDC): أكثر الأنواع شيوعًا، يبدأ في القنوات الحليبية ثم ينتشر إلى الأنسجة المحيطة.\nسرطان الفصوص الغازي (ILC): ينشأ في الغدد المنتجة للحليب"

            }
        },
         {
            "tag": "البيانات الواجب ادخالها",
            "patterns": [
                "شو التحاليل التي يطلبها الدكتور لكشف الشخص المصاب ب [X]",
                "شو لازم دخل بيانات ل [X]",
                "شو هي البيانات اللي لازم يعرفها الدكتور عن حالتي ب [X]",
                "ما هي البيانات المطلوبة لتقييم حالة [X]",
                "ما هي التحاليل اللازمة للكشف عن [X]",
                "شو هي البيانات يلي لازم دخلها لتشخيص [X]",
                "ماهي البيانات التي نكشف من خلالها الاصابة ب [X]",
                "ماهي البيانات الواجب ادخالها ل [X]"
            ],
            "slots": {
                "X": [
                    "ارتفاع ضغط الدم",
                    "الباركنسون",
                    "التهاب الكبد",
                    "الجلطة",
                    "السكري",
                    "القلب",
                    "الغدة الدرقية",
                    "سرطان الرئة",
                    "سرطان الثدي",
                    "الربو",
                    "الزهايمر",
                    "فقر الدم"

                ]
            },
            "responses": {
                "ارتفاع ضغط الدم": "يجب إدخال مجموعة من البيانات الصحية المتعلقة بالمريض ، وتشمل هذه البيانات: العمر (age): عمر المريض. الجنس (sex): الجنس (0 للإناث، 1 للذكور). نوع الألم الصدري (cp): يتراوح بين 0 و3 لتمثيل أنواع مختلفة من الألم الصدري. ضغط الدم الانقباضي (trestbps): ضغط الدم الانقباضي (مم زئبق). مستوى الكوليسترول (chol): مستوى الكوليسترول في الدم (ملغم/دل).       سكر الدم الصائم (fbs): نسبة السكر في الدم (0 إذا كانت أقل من 120 ملغم/دل، و1 إذا كانت أكبر أو تساوي 120 ملغم/دل). نتائج رسم القلب (restecg): نتائج رسم القلب (0، 1، أو 2). أقصى معدل نبضات قلب (thalach): أقصى معدل نبضات قلب وصل إليه المريض. الذبحة الصدرية الناتجة عن الإجهاد (exang): وجود الذبحة الصدرية الناتجة عن الإجهاد (0 لا توجد، 1 توجد). الانخفاض في شريحة ST (oldpeak): مستوى الانخفاض في شريحة ST بعد التمرين (مم). ميل شريحة ST (slope): ميل شريحة ST (0، 1، أو 2). عدد الأوعية الدموية الملونة (ca): عدد الأوعية الدموية الملونة من خلال الفحص (من 0 إلى 4). حالة ثال (thal): نوع حالة الثالاسيما (1، 2،  3).",
                "الباركنسون": "لازم تدخل البيانات التالية لتحليل مرض الباركنسون:\n- **MDVP:Fo(Hz)**: متوسط تردد الصوت الأساسي.\n- **MDVP:Fhi(Hz)**: أعلى تردد للصوت الأساسي.\n- **MDVP:Flo(Hz)**: أقل تردد للصوت الأساسي.\n- **MDVP:Jitter(Abs)**, **Jitter:DDP**: قياسات لتغيرات التردد الأساسي.\n- **Shimmer:APQ5**: قياس لتغيرات السعة.\n- **NHR**: نسبة الضجيج للصوت.\n- **spread1**, **spread2**, **PPE**: قياسات غير خطية لتغيرات التردد.",
                "التهاب الكبد": "بيانات التهاب الكبد :العمر (Age): عمر المريض. الجنس (Sex): الجنس (m للذكور، f للإناث). الألبومين (ALB): مستوى الألبومين في الدم (غرام/لتر). الفوسفاتاز القلوي (ALP): مستوى إنزيم ALP في الدم (وحدات دولية/لتر). الإنزيم الكبدي ALT (ALT): مستوى الإنزيم ALT (وحدات دولية/لتر). الإنزيم الكبدي AST (AST): مستوى الإنزيم AST (وحدات دولية/لتر). البيليروبين (BIL): مستوى البيليروبين (ميكرو مول/لتر). الكولينستيراز (CHE): مستوى الكولينستيراز (كيلو وحدة/لتر). الكوليسترول (CHOL): مستوى الكوليسترول (ميلي مول/لتر). الكرياتينين (CREA): مستوى الكرياتينين (ميكرومول/لتر). إنزيم GGT (GGT): مستوى إنزيم GGT (وحدات دولية/لتر). البروتين (PROT): مستوى البروتين في الدم (غرام/لتر).",
                "الجلطة": "الجنس: ذكر أو أنثى.\n العمر: عمر المريض.\n ضغط الدم المرتفع: 0 إذا ما عنده ضغط دم، 1 إذا عنده ضغط دم.\n أمراض القلب: 0 إذا ما عنده أمراض قلب، 1 إذا عنده.\n متزوج: نعم أو لا.\n نوع العمل: أطفال، عمل حكومي، ما اشتغل، خاص أو مستقل.\n نوع الإقامة: ريف أو مدينة.\n مستوى السكر بالدم: مستوى السكر المتوسط بالدم.\n مؤشر كتلة الجسم: BMI.\n حالة التدخين: دخن سابقاً، ما دخن، مدخن أو غير معروف.",
                "السكري": "البيانات المطلوبة تشمل عدد الحملات السابقة، نسبة الجلوكوز في الدم، ضغط الدم، سمك الجلد، نسبة الأنسولين، مؤشر كتلة الجسم، وعمر المريض.",
                "القلب": "Age (العمر), Sex (الجنس), ChestPainType (نوع ألم الصدر), RestingBP (ضغط الدم في حالة الراحة), Cholesterol (مستوى الكوليسترول), FastingBS (سكر الدم الصائم), RestingECG (نتائج تخطيط القلب الكهربائي أثناء الراحة), MaxHR (أقصى معدل ضربات القلب), ExerciseAngina (الذبحة الصدرية الناتجة عن التمرين), Oldpeak (الاكتئاب الناتج عن التمرين مقارنة بالراحة), ST_Slope (ميل مقطع ST أثناء التمرين)",
                "الغدة الدرقية": "\"العمر: عمر المريض.\\n الجنس: ذكر أو أنثى.\\n TT4: مستوى TT4 في الدم.\\n T3: مستوى T3 في الدم.\\n T4U: مستوى T4U في الدم.\\n FTI: مستوى FTI في الدم.\\n TSH: مستوى TSH في الدم.\\n الحمل: هل المريض حامل؟ (نعم/لا)\"\n",
                "سرطان الرئة": "\nالبيانات الواجب إدخالها:\nGENDER: هل هو الجنس؟\nAGE: ما عمره؟\nSMOKING: هل يدخن؟\nYELLOW_FINGERS: هل لديه أصابع صفراء؟\nANXIETY: هل لديه قلق؟\nPEER_PRESSURE: هل لديه ضغط من الأقران؟\nCHRONIC_DISEASE: هل لديه أمراض مزمنة؟\nFATIGUE: هل لديه إرهاق؟\nALLERGY: هل لديه حساسية؟\nWHEEZING: هل لديه صفير عند التنفس؟\nALCOHOL_CONSUMING: هل لديه استهلاك للكحول؟\nCOUGHING: هل لديه سعال؟\nSHORTNESS_OF_BREATH: هل لديه ضيق في التنفس؟\nSWALLOWING_DIFFICULTY: هل لديه صعوبة في البلع؟\nCHEST_PAIN: هل لديه ألم في الصدر؟\nLUNG_CANCER: ",
                "سرطان الثدي": "البيانات المطلوبة لتشخيص سرطان الثدي هي: mean_radius (متوسط نصف القطر)، mean_texture (متوسط التباين في نسيج الكتلة)، mean_perimeter (متوسط محيط الكتلة)، mean_area (متوسط مساحة الكتلة)، mean_smoothness (متوسط السلاسة)، وdiagnosis الذي يكون إما M (خبيث) أو B (حميد).",
                "الربو" : " البيانات الواجب إدخالها لمرض الربو: Age (العمر)، Gender (الجنس)، Ethnicity (العرق)، EducationLevel (مستوى التعليم)، BMI (مؤشر كتلة الجسم)، Smoking (حالة التدخين)، PhysicalActivity (النشاط البدني)، DietQuality (جودة النظام الغذائي)، SleepQuality (جودة النوم)، PollutionExposure (التعرض للتلوث)، PollenExposure (التعرض لحبوب اللقاح)، DustExposure (التعرض للغبار)، PetAllergy (حساسية الحيوانات)، FamilyHistoryAsthma (تاريخ عائلي للربو)، HistoryOfAllergies (تاريخ الحساسية)، Eczema (الأكزيما)، HayFever (حمى القش)، GastroesophagealReflux (ارتجاع المريء)، LungFunctionFEV1 (حجم الزفير القسري)، LungFunctionFVC (السعة الحيوية القسرية)، Wheezing (الصفير)، ShortnessOfBreath (ضيق التنفس)، ChestTightness (ضيق الصدر)، Coughing (السعال)، NighttimeSymptoms (الأعراض الليلية)، ExerciseInduced (الأعراض بعد التمارين)، Diagnosis (التشخيص).",
                "الزهايمر" : "البيانات الواجب إدخالها لمرض الزهايمر تشمل: Age (العمر), Gender (الجنس), Ethnicity (العرق), EducationLevel (مستوى التعليم), BMI (مؤشر كتلة الجسم), Smoking (التدخين), AlcoholConsumption (استهلاك الكحول), PhysicalActivity (النشاط البدني), DietQuality (جودة النظام الغذائي), SleepQuality (جودة النوم), FamilyHistoryAlzheimers (تاريخ عائلي لمرض الزهايمر), CardiovascularDisease (أمراض القلب), Diabetes (مرض السكري), Depression (الاكتئاب), HeadInjury (إصابات الرأس), Hypertension (ارتفاع ضغط الدم), SystolicBP (ضغط الدم الانقباضي), DiastolicBP (ضغط الدم الانبساطي), CholesterolTotal (مستوى الكوليسترول الكلي), CholesterolLDL (مستوى الكوليسترول LDL), CholesterolHDL (مستوى الكوليسترول HDL), CholesterolTriglycerides (مستوى الدهون الثلاثية), MMSE (اختبار الحالة العقلية المصغرة), FunctionalAssessment (التقييم الوظيفي), MemoryComplaints (الشكاوى المتعلقة بالذاكرة), BehavioralProblems (المشاكل السلوكية), ADL (الأنشطة اليومية الأساسية), Confusion (الارتباك), Disorientation (عدم التوجه), PersonalityChanges (تغييرات في الشخصية), DifficultyCompletingTasks (صعوبة في إتمام المهام), Forgetfulness (النسيان), Diagnosis (التشخيص).",
                "فقر الدم" : "البيانات الواجب إدخالها لمرض فقر الدم هي: الجنس (Gender)، مستوى الهيموجلوبين (Hemoglobin)، MCH (متوسط الهيموجلوبين في الخلايا الحمراء)، MCHC (تركيز الهيموجلوبين في الخلايا الحمراء)، MCV (حجم الخلايا الحمراء المتوسطة)"

            }
        },
        {
            "tag": "مصدر بيانات المرض ",
            "patterns": [
                " مصدر بيانات [X]",
                "ما هو مصدر بيانات [X]",
                "كيف يتم الحصول على بيانات [X]",
                "من أين تأتي معلومات تحليل [X]",
                " بيانات [X] من وين مأخوذة؟",
                "من وين الدكتور بياخد معلومات عن [X]",
                "من وين نقدر نحصل على بيانات تحليل [X]",
                "وين جبت بيانات [X]"
            ],
            "slots": {
                "X": [
                    "الباركنسون",
                    "الجلطة",
                    "التهاب الكبد",
                    "الزهايمر",
                    "الربو",
                    "السكري",
                    "القلب",
                    "الغدة الدرقية",
                    "سرطان الرئة",
                    "سرطان الثدي",
                    "ارتفاع ضغط الدم",
                    "فقر الدم"

                ]
            },
            "responses": {
                "الباركنسون": "بيانات مرض الباركنسون مأخوذة من كاغل. ممكن تزور الموقع للمزيد من المعلومات:\nhttps://www.kaggle.com/datasets/debasisdotcom/parkinson-disease-detection/data",
                "الجلطة": "البيانات مأخوذة من كاغل، زوروا الموقع للمزيد من المعلومات. \nhttps://www.kaggle.com/datasets/fedesoriano/stroke-prediction-dataset",
                "التهاب الكبد": "https://www.kaggle.com/datasets/fedesoriano/hepatitis-c-dataset",
                "الزهايمر": "البيانات مأخوذة من كاغل، زوروا الموقع للمزيد من المعلومات. https://www.kaggle.com/datasets/rabieelkharoua/alzheimers-disease-dataset",
                "الربو": "البيانات مأخوذة من كاغل، زوروا الموقع للمزيد من المعلومات. https://www.kaggle.com/datasets/rabieelkharoua/asthma-disease-dataset",
                "السكري": "مصدر البيانات هو السجلات الصحية الشخصية، مثل نتائج اختبارات الجلوكوز في الدم وتحاليل المختبرات التي تشمل فحص الدم والصحة العامة، وهذه المجموعة من البيانات مستمدة في الأصل من المعهد الوطني للسكري وأمراض الجهاز الهضمي والكلى، والهدف هو التنبؤ بناءً على القياسات التشخيصية بما إذا كان المريض مصابًا بالسكري أم لا.",
                "القلب": "تم دمج مجموعات بيانات عن امراض القلب عبر 11 ميزة شائعة , مما يجعلها اكبر مجموعة بيانات متاحة حتى الآن لاغراض البحث ",
                "الغدة الدرقية": "البيانات مأخوذة من كاغل، زوروا الموقع للمزيد من المعلومات. https://www.kaggle.com/datasets/rabieelkharoua/asthma-disease-dataset",
                "سرطان الثدي ": "https://www.kaggle.com/datasets/merishnasuwal/breast-cancer-prediction-dataset",
                "سرطان الرئة " : "https://www.kaggle.com/datasets/akashnath29/lung-cancer-dataset",
                "ارتفاع ضغط الدم ": " https://www.kaggle.com/datasets/prosperchuks/health-dataset?select=hypertension_data.csv",
                "فقر الدم" : "https://www.kaggle.com/datasets/biswaranjanrao/anemia-dataset?select=anemia.csv"

            }
        },



      {
            "tag": "نتائج تحليل المرض ",
            "patterns": [
              "ماهي النتائج التي يظهرها تحليل مرض [X]",
                "شو النتائج اللي بيطلعها تحليل مرض [X]؟",
                "شو بيوضحلنا تحليل [X] من نتائج؟",
                "شو نوع النتائج اللي ممكن تطلع بتحليل [X]؟",
                "شو ممكن نعرف من تحليل مرض [X]؟",
                "شو بيبين معنا بتحليل مرض [X]؟",
                "شو النتائج يلي بيظهرها هذا التحليل"
            ],
            "slots": {
                "X": [
                  "القلب",
                  "الجلطة",
                  "الباركنسون",
                  "السكري",
                  "التهاب الكبد",
                  "ارتفاع ضغط الدم",
                  "سرطان الثدي",
                  "الغدة الدرقية",
                  "الربو",
                  "الزهايمر",
                  "فقر الدم",
                  "سرطان الرئة"
                ]
            },
            "responses": {
              "القلب":"Age (العمر): رقم يمثل عمر الشخص بالسنوات، Sex (الجنس): 1 للذكر، 0 للأنثى، ChestPainType (نوع ألم الصدر): 0 بدون أعراض، 1 ذبحة غير نمطية، 2 ألم غير مرتبط بالذبحة الصدرية، 3 ذبحة صدرية نمطية، RestingBP (ضغط الدم في حالة الراحة): رقم يمثل ضغط الدم الانقباضي، Cholesterol (مستوى الكوليسترول): رقم يمثل مستوى الكوليسترول في الدم، FastingBS (سكر الدم الصائم): 1 إذا كان مستوى السكر ≥ 126 ملغ/ديسيلتر، 0 إذا كان أقل، RestingECG (نتائج تخطيط القلب الكهربائي أثناء الراحة): 0 طبيعي، 1 تشوهات في موجة ST-T، 2 تضخم بطيني أيسر، MaxHR (أقصى معدل ضربات القلب): رقم يمثل أقصى عدد ضربات القلب، ExerciseAngina (الذبحة الصدرية الناتجة عن التمرين): 1 إذا كانت موجودة، 0 إذا لم تكن، Oldpeak (الاكتئاب الناتج عن التمرين): رقم يمثل انخفاض مستوى ST، ST_Slope (ميل مقطع ST): 0 هابط، 1 مسطح، 2 صاعد.",
              "الجلطة":"التوقع إذا كان الشخص معرض للإصابة بالجلطة أو لا بناءً على البيانات المدخلة.",
              "الباركنسون":"النتيجة بتوضح إذا الشخص معرض لمرض الباركنسون أو لا، بناءً على البيانات المدخلة. التوقع بيتم من خلال تحليل الأنماط الموجودة بالبيانات اللي انت قدمتها.",
              "السكري":"Glucose (الجلوكوز): إذا كان مستوى الجلوكوز مرتفعًا، فقد يشير ذلك إلى الإصابة بالسكري,Blood Pressure (ضغط الدم): ارتفاع ضغط الدم يرتبط بزيادة خطر الإصابة بالسكري.,Insulin (الأنسولين): قلة الأنسولين أو ارتفاع مستوياته غير الطبيعية قد تشير إلى وجود مشكلة في كيفية تعامل الجسم مع السكر.,BMI (مؤشر كتلة الجسم): السمنة هي عامل خطر رئيسي للإصابة بالسكري من النوع الثاني.,Outcome (النتيجة): النتيجة النهائية تحدد ما إذا كان الشخص مصابًا بالسكري (1) أو غير مصاب (0)",
              "التهاب الكبد":"التحليل سيُحدد ما إذا كان الشخص مصابًا بالتهاب الكبد أو لا. يتضمن التصنيف فئات مثل: 0 : متبرع بالدم (غير مصاب) 1 : مصاب بالتهاب الكبد",
              "ارتفاع ضغط الدم": "التحليل يعرض ما إذا كان المريض يعاني من ارتفاع ضغط الدم أو أي حالة قلبية مرتبطة. تكون النتيجة :0 : إذا كان الشخص لا يعاني من مشاكل صحية متعلقة بضغط الدم 1 :  إذا كان الشخص يعاني من ارتفاع ضغط الدم .",
              "سرطان الثدي": "نتيجة بيانات سرطان الثدي هي: mean_radius (6.98-28.11)، mean_texture (9.71-39.28)، mean_perimeter (43.79-188.5)، mean_area (143.5-2501.0)، mean_smoothness (0.05263-0.1634)، وdiagnosis يكون M (خبيث) عند القيم المرتفعة وB (حميد) عند القيم المنخفضة.",
              "الغدة الدرقية": "نتيجة الغدة الدرقية تعتمد على القيم المدخلة ويمكن مقارنة القيم المدخلة بالمعايير الطبية المرجعية: TT4 (هرمون الثيروكسين) النطاق الطبيعي 60-140 نانومول/لتر، T3 (هرمون ثلاثي يود الثيرونين) النطاق الطبيعي 1.2-2.8 نانومول/لتر، T4U (T4 غير المرتبط) النطاق الطبيعي 0.8-1.2، FTI (مؤشر الثيروكسين الحر) النطاق الطبيعي 80-120، TSH (هرمون منبه الدرقية) النطاق الطبيعي 0.5-4.5 ميكرووحدة/لتر.",
              "الربو" :" نتيجة بيانات مرض الربو: Age (العمر): قيمة عددية تمثل عمر الشخص (مثل 5 إلى 85)، Gender (الجنس): 0 = ذكر، 1 = أنثى، Ethnicity (العرق): 1 = آسيوي، 2 = أوروبي، 3 = إفريقي، 4 = عربي، 5 = آخر، EducationLevel (مستوى التعليم): 1 = ابتدائي، 2 = ثانوي، 3 = جامعي، 4 = دراسات عليا، BMI (مؤشر كتلة الجسم): قيمة عشرية تتراوح بين 18.5 إلى 40، Smoking (حالة التدخين): 0 = غير مدخن، 1 = مدخن، 2 = مدخن سابق، PhysicalActivity (النشاط البدني): 0 = قليل جدًا، 1 = معتدل، 2 = مرتفع، DietQuality (جودة النظام الغذائي): 1 = ضعيف، 2 = متوسط، 3 = جيد، SleepQuality (جودة النوم): 1 = ضعيف، 2 = متوسط، 3 = جيد، PollutionExposure (التعرض للتلوث): 1 = منخفض، 2 = متوسط، 3 = مرتفع، PollenExposure (التعرض لحبوب اللقاح): 0 = غير معرض، 1 = معرض، DustExposure (التعرض للغبار): 0 = غير معرض، 1 = معرض، PetAllergy (حساسية الحيوانات): 0 = لا، 1 = نعم، FamilyHistoryAsthma (تاريخ عائلي للربو): 0 = لا، 1 = نعم، HistoryOfAllergies (تاريخ الحساسية): 0 = لا، 1 = نعم، Eczema (الأكزيما): 0 = لا، 1 = نعم، HayFever (حمى القش): 0 = لا، 1 = نعم، GastroesophagealReflux (ارتجاع المريء): 0 = لا، 1 = نعم، LungFunctionFEV1 (FEV1): نسبة مئوية (50% إلى 120%)، LungFunctionFVC (FVC): نسبة مئوية (50% إلى 120%)، Wheezing (الصفير): 0 = لا، 1 = نعم، ShortnessOfBreath (ضيق التنفس): 0 = لا، 1 = نعم، ChestTightness (ضيق الصدر): 0 = لا، 1 = نعم، Coughing (السعال): 0 = لا، 1 = نعم، NighttimeSymptoms (الأعراض الليلية): 0 = لا، 1 = نعم، ExerciseInduced (الأعراض بعد التمارين): 0 = لا، 1 = نعم، Diagnosis (التشخيص): 0 = غير مصاب، 1 = مصاب. ",
              "الزهايمر" : "نتيجة بيانات مرض الزهايمر : 1. Age (العمر) قيمة عددية تمثل عمر الشخص. مثال: 70 2. Gender (الجنس) 0: أنثى 1: ذكر 3. Ethnicity (العرق) قيمة عددية تمثل العرق. يمكن استخدام الترميز التالي: 1: أبيض 2: أسود 3: آسيوي 4: هسباني أو لاتيني 5: آخر 4. EducationLevel (مستوى التعليم) قيمة عددية تمثل مستوى التعليم. 1: بدون تعليم 2: تعليم ابتدائي 3: تعليم متوسط 4: تعليم ثانوي 5: تعليم جامعي 6: دراسات عليا 5. BMI (مؤشر كتلة الجسم) قيمة عددية تمثل مؤشر كتلة الجسم. مثال: 27.5 6. Smoking (التدخين) 0: لا يدخن 1: يدخن 7. AlcoholConsumption (استهلاك الكحول) 0: لا يشرب الكحول 1: يشرب الكحول 8. PhysicalActivity (النشاط البدني) 0: لا يمارس النشاط البدني 1: يمارس النشاط البدني 9. DietQuality (جودة النظام الغذائي) 1: ضعيف 2: متوسط 3: جيد 4: ممتاز 10. SleepQuality (جودة النوم) 1: ضعيف 2: متوسط 3: جيد 4: ممتاز 11. FamilyHistoryAlzheimers (تاريخ عائلي لمرض الزهايمر) 0: لا 1: نعم 12. CardiovascularDisease (أمراض القلب) 0: لا 1: نعم 13. Diabetes (مرض السكري) 0: لا 1: نعم 14. Depression (الاكتئاب) 0: لا 1: نعم 15. HeadInjury (إصابات الرأس) 0: لا 1: نعم 16. Hypertension (ارتفاع ضغط الدم) 0: لا 1: نعم 17. SystolicBP (ضغط الدم الانقباضي) قيمة عددية تمثل ضغط الدم الانقباضي. مثال: 130 18. DiastolicBP (ضغط الدم الانبساطي) قيمة عددية تمثل ضغط الدم الانبساطي. مثال: 85 19. CholesterolTotal (مستوى الكوليسترول الكلي) قيمة عددية تمثل مستوى الكوليسترول الكلي. مثال: 200 mg/dL 20. CholesterolLDL (مستوى الكوليسترول LDL) قيمة عددية تمثل مستوى الكوليسترول LDL. مثال: 100 mg/dL 21. CholesterolHDL (مستوى الكوليسترول HDL) قيمة عددية تمثل مستوى الكوليسترول HDL. مثال: 60 mg/dL 22. CholesterolTriglycerides (مستوى الدهون الثلاثية) قيمة عددية تمثل مستوى الدهون الثلاثية. مثال: 150 mg/dL 23. MMSE (اختبار الحالة العقلية المصغرة) قيمة عددية تمثل درجة اختبار الحالة العقلية المصغرة. مثال: 28 24. FunctionalAssessment (التقييم الوظيفي) قيمة عددية تمثل التقييم الوظيفي. 0: لا يوجد اضطراب وظيفي 1: اضطراب وظيفي بسيط 2: اضطراب وظيفي متوسط 3: اضطراب وظيفي شديد 25. MemoryComplaints (الشكاوى المتعلقة بالذاكرة) 0: لا يوجد 1: يوجد 26. BehavioralProblems (المشاكل السلوكية) 0: لا يوجد 1: يوجد 27. ADL (الأنشطة اليومية الأساسية) قيمة عددية تمثل القدرة على أداء الأنشطة اليومية. 1: قادر على أداء الأنشطة اليومية 2: بحاجة إلى مساعدة 3: غير قادر على أداء الأنشطة اليومية 28. Confusion (الارتباك) 0: لا يوجد 1: يوجد 29. Disorientation (عدم التوجه) 0: لا يوجد 1: يوجد 30. PersonalityChanges (تغييرات في الشخصية) 0: لا يوجد 1: يوجد 31. DifficultyCompletingTasks (صعوبة في إتمام المهام) 0: لا يوجد 1: يوجد 32. Forgetfulness (النسيان) 0: لا يوجد 1: يوجد 33. Diagnosis (التشخيص) 0: لا توجد أعراض للزهايمر 1: الزهايمر المرحلة المبكرة 2: الزهايمر المرحلة المتقدمة.",
              "فقر الدم": "تتضمن بيانات فقر الدم ما يلي: الجنس (ذكر أو أنثى)، مستوى الهيموجلوبين (13.8–17.2 g/dL للذكور، 12.1–15.1 g/dL للإناث)، MCH (متوسط الهيموجلوبين في الخلايا الحمراء) بين 27–31 pg، MCHC (تركيز الهيموجلوبين في الخلايا الحمراء) بين 32–36 g/dL، وMCV (حجم الخلايا الحمراء المتوسطة) بين 80–100 fL. النتيجة تُعتبر طبيعية إذا كانت القيم ضمن المعدلات الطبيعية، أو  إذا كانت القيم منخفضة، مما قد يشير إلى أنواع مختلفة من فقر الدم، مثل فقر الدم الناتج عن نقص الحديد أو فقر الدم كبير الكريات أو صغير الكريات.",
              "سرطان الرئة" : "نتيجة بيانات سرطان الرئة هي: GENDER (الجنس) = 1/0, AGE (العمر) = 0/1/2, SMOKING (التدخين) = 1/0, YELLOW_FINGERS (أصابع صفراء) = 1/0, ANXIETY (القلق) = 1/0, PEER_PRESSURE (ضغط الأقران) = 1/0, CHRONIC_DISEASE (مرض مزمن) = 1/0, FATIGUE (الإرهاق) = 1/0, ALLERGY (الحساسية) = 1/0, WHEEZING (الصفير) = 1/0, ALCOHOL_CONSUMING (استهلاك الكحول) = 1/0, COUGHING (السعال) = 1/0, SHORTNESS_OF_BREATH (ضيق التنفس) = 1/0, SWALLOWING_DIFFICULTY (صعوبة البلع) = 1/0, CHEST_PAIN (ألم في الصدر) = 1/0, LUNG_CANCER (سرطان الرئة) = 1/0."
            }
        }
    ]
}